Documents/ESB/ESB_Consumer_1023/003TestSample/SAMPLE_XML_MUST/eStatement/ES05_eStmtDtlsInqRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/eStatement/eStmtDtlsInqRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>eStatement</ServiceDomain>  
      <OperationName>eStmtDtlsInq</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:eStmtDtlsInqRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>ES05</v11:TxnId>  
        <v11:TxnNo>ES0500001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <v11:CustPermId>A123456789</v11:CustPermId>  
        <v11:InqMnth>201601</v11:InqMnth> 
      </v11:ServiceBody> 
    </v11:eStmtDtlsInqRq> 
  </soap:Body> 
</soap:Envelope>
